#05: Membalik urutan baris dan kolom pada Data Frame

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.3
2.3.4

Persiapan Data Frame

In [2]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  6  8  5  1  3
1  7  9  6  3  6
2  2  8  8  3  6
3  2  1  5  6  2
4  4  7  8  4  4

Membalik urutan kolom

In [3]:
df.loc[:, ::-1]

   E  D  C  B  A
0  3  1  5  8  6
1  6  3  6  9  7
2  6  3  8  8  2
3  2  6  5  1  2
4  4  4  8  7  4

Membalik urutan baris

In [4]:
df.loc[::-1]

   A  B  C  D  E
4  4  7  8  4  4
3  2  1  5  6  2
2  2  8  8  3  6
1  7  9  6  3  6
0  6  8  5  1  3

Membalik urutan baris dan melakukan penyesuaian ulang index

In [5]:
df.loc[::-1].reset_index(drop=True)

   A  B  C  D  E
0  4  7  8  4  4
1  2  1  5  6  2
2  2  8  8  3  6
3  7  9  6  3  6
4  6  8  5  1  3

#06: Mengganti nama (label) kolom pada Data Frame

In [6]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.3
2.3.4

Persiapan Data Frame

In [7]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  7  5  7  8  7
1  6  3  3  5  5
2  3  3  1  3  2
3  7  2  3  7  6
4  2  4  1  4  1

Mengganti nama (label) untuk sebuah kolom pada Data Frame

In [8]:
df.rename(columns={'C':'Hobi'})

   A  B  Hobi  D  E
0  7  5     7  8  7
1  6  3     3  5  5
2  3  3     1  3  2
3  7  2     3  7  6
4  2  4     1  4  1

Mengganti nama (label) untuk banyak kolom pada Data Frame

In [9]:
df.rename(columns={'A':'Nama', 'B':'Alamat', 'D':'Kota'})

   Nama  Alamat  C  Kota  E
0     7       5  7     8  7
1     6       3  3     5  5
2     3       3  1     3  2
3     7       2  3     7  6
4     2       4  1     4  1

#07: Menghapus (drop) missing values (NaN)

In [10]:
import pandas as pd

print(pd.__version__)

2.3.3

Persiapan Data Frame

In [11]:
n_rows = 30
n_cols = 4
cols = ['A', 'B', 'C', 'D']

df = pd.DataFrame(np.random.randn(n_rows, n_cols), columns=cols)

nan_mask = np.random.rand(n_rows, n_cols) < 0.2
df[nan_mask] = np.nan

df = df.reset_index()
df.head()

   index         A         B         C         D
0      0  1.965945  0.717449 -0.219837       NaN
1      1  2.045613 -0.865853 -0.387562  0.965609
2      2       NaN -0.292730 -0.212201 -0.465825
3      3  0.888615  1.002100  0.384876  0.605892
4      4 -0.915390 -0.208535  0.138772       NaN

In [12]:
df = df.rename(columns={'index':'Z'})
df.head()

   Z         A         B         C         D
0  0  1.965945  0.717449 -0.219837       NaN
1  1  2.045613 -0.865853 -0.387562  0.965609
2  2       NaN -0.292730 -0.212201 -0.465825
3  3  0.888615  1.002100  0.384876  0.605892
4  4 -0.915390 -0.208535  0.138772       NaN

In [13]:
df_backup = df.copy(deep=True)

Menghapus (drop) setiap kolom yang mengandung missing values

In [14]:
df = df.dropna(axis='columns') 
df.head()

   Z
0  0
1  1
2  2
3  3
4  4

Menghapus (drop) setiap baris yang mengandung missing values

In [15]:
df = df_backup.copy(deep=True)
df = df.dropna(axis='rows')
df.head()

   Z         A         B         C         D
1  1  2.045613 -0.865853 -0.387562  0.965609
3  3  0.888615  1.002100  0.384876  0.605892
6  6  1.517883  0.110366  1.085394  0.984080
7  7  0.714336 -0.868317 -0.985813  0.400717
8  8  0.275220  1.220191 -0.661373  0.211710

Persentase missing values untuk tiap kolom

In [16]:
df = df_backup.copy(deep=True)
df.isna().mean()

Z    0.000000
A    0.233333
B    0.066667
C    0.100000
D    0.200000
dtype: float64

Menghapus (drop) setiap kolom yang mengandung missing values berdasarkan threshold

In [17]:
treshold = len(df) * 0.9
df = df.dropna(thresh=treshold, axis='columns')
df.head()

   Z         B         C
0  0  0.717449 -0.219837
1  1 -0.865853 -0.387562
2  2 -0.292730 -0.212201
3  3  1.002100  0.384876
4  4 -0.208535  0.138772

#08: Memeriksa kesamaan antar dua buah kolom (Series) pada Data Frame

In [18]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.3
2.3.4

Persiapan Data Frame

In [19]:
data = {'A':[15, 15, 18, np.nan, 12], 
        'B':[15, 15, 18, np.nan, 12]}

df = pd.DataFrame(data)
df

      A     B
0  15.0  15.0
1  15.0  15.0
2  18.0  18.0
3   NaN   NaN
4  12.0  12.0

Mengenal Pandas Series

In [20]:
df['A']

0    15.0
1    15.0
2    18.0
3     NaN
4    12.0
Name: A, dtype: float64

In [21]:
type(df['A'])

pandas.core.series.Series

In [22]:
type(df)

pandas.core.frame.DataFrame

Memeriksa kesamaan dengan operator ==

In [23]:
df['A'] == df['B']

0     True
1     True
2     True
3    False
4     True
dtype: bool

Memeriksa kesamaan dengan method equals()

In [24]:
df['A'].equals(df['B'])

True

Memeriksa kesamaan antar dua Data Frame

In [25]:
df1 = df.copy(deep=True)

df.equals(df1)

True

In [26]:
df == df1

       A      B
0   True   True
1   True   True
2   True   True
3  False  False
4   True   True